In [12]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')
import warnings
warnings.simplefilter(action='ignore',category=np.VisibleDeprecationWarning)

## Review

From your homework: 

> *Below we load ... 200,000 weekday Uber rides in the ...  Boston, Massachusetts metropolitan area from the [Uber Movement](https://www.uber.com/newsroom/introducing-uber-movement-2/) project. The `sourceid` and `dstid` columns contain codes corresponding to start and end locations of each ride. The `hod` column contains codes corresponding to the hour of the day the ride took place. The `ride time` column contains the length of the ride in minutes.*

In [13]:
boston = Table.read_table("boston.csv")
boston.show(6)

**Discussion Question:** I would like to add a column to this dataset giving the ride time in seconds. 

What is a method that makes the most sense:

- If I plan to work with only the `boston` dataset?
- If I plan to work with multiple Uber Movement datasets, such as the `manila` dataset you saw in your homework?

In [14]:
boston.with_columns('ride time seconds', boston.column('ride time')*60)

sourceid | dstid | hod  | ride time | ride time seconds
584      | 33    | 7    | 11.866    | 711.96
1013     | 1116  | 13   | 17.7993   | 1067.96
884      | 1190  | 22   | 19.3488   | 1160.93
211      | 364   | 1    | 1.7235    | 103.41
218      | 1189  | 7    | 42.5588   | 2553.53
1048     | 461   | 7    | 26.4212   | 1585.27
879      | 461   | 11   | 23.7743   | 1426.46
1047     | 1002  | 17   | 36.3583   | 2181.5
930      | 856   | 6    | 16.6407   | 998.44
1110     | 875   | 22   | 17.3533   | 1041.2
... (199990 rows omitted)

In [15]:
def mins_to_seconds(times):
    return times*60

In [16]:
boston.with_columns('ride time seconds', boston.apply(mins_to_seconds,'ride time'))

sourceid | dstid | hod  | ride time | ride time seconds
584      | 33    | 7    | 11.866    | 711.96
1013     | 1116  | 13   | 17.7993   | 1067.96
884      | 1190  | 22   | 19.3488   | 1160.93
211      | 364   | 1    | 1.7235    | 103.41
218      | 1189  | 7    | 42.5588   | 2553.53
1048     | 461   | 7    | 26.4212   | 1585.27
879      | 461   | 11   | 23.7743   | 1426.46
1047     | 1002  | 17   | 36.3583   | 2181.5
930      | 856   | 6    | 16.6407   | 998.44
1110     | 875   | 22   | 17.3533   | 1041.2
... (199990 rows omitted)

In [11]:
boston.where('boston', 'ride time')

ValueError: label "boston" not in labels ('sourceid', 'dstid', 'hod', 'ride time')

## New material

### One-column groups

In [17]:
cones = Table.read_table('cones.csv')
cones_without_color = cones.drop('Color')

In [18]:
cones_without_color

Flavor     | Price
strawberry | 3.55
chocolate  | 4.75
chocolate  | 5.25
strawberry | 5.25
chocolate  | 5.25
bubblegum  | 4.75

In [20]:
cones_without_color

Flavor     | Price
strawberry | 3.55
chocolate  | 4.75
chocolate  | 5.25
strawberry | 5.25
chocolate  | 5.25
bubblegum  | 4.75

In [26]:
cones_without_color.group('Flavor', np.average)

Flavor     | Price average
bubblegum  | 4.75
chocolate  | 5.08333
strawberry | 4.4

### Two-column groups

In [28]:
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [29]:
cones.group(['Flavor','Color'],np.average)

Flavor     | Color       | Price average
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 5.25
chocolate  | light brown | 4.75
strawberry | pink        | 4.4

In [31]:
cones.group(['Flavor','Color'], min)

Flavor     | Color       | Price min
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 5.25
chocolate  | light brown | 4.75
strawberry | pink        | 3.55

### `nba_salaries` dataset

In [33]:
nba = Table.read_table("nba_salaries.csv")
nba.show(6)

#### **Task**: Find the five teams paying the highest average salary (in millions) in 2010.
- Your results should be in the form of a table with 5 rows and 2 columns:
    - One column should have the team name
    - The other column should have the average salary for that team, in millions.
- Challenge: Try to only use `Table.select()` or `Table.drop()` *once* in your solution.

In [39]:
nba.where('season',2010).select('team','salary').group('team', np.average)

team                | salary average
Atlanta Hawks       | 4.4734e+06
Boston Celtics      | 5.71586e+06
Brooklyn Nets       | 7.1e+06
Charlotte Bobcats   | 4.44677e+06
Charlotte Hornets   | 736420
Chicago Bulls       | 3.47643e+06
Cleveland Cavaliers | 5.41492e+06
Dallas Mavericks    | 7.10886e+06
Denver Nuggets      | 5.23666e+06
Detroit Pistons     | 3.92461e+06
... (23 rows omitted)

In [40]:
def average_in_millions(x):
    """finds the average of a list of numbers and divides by one million"""
    average = np.average(x)
    return average/1e6

In [42]:
salary_table_2010 = nba.where('season', 2020).select('team', 
                                 'salary').group('team', average_in_millions)

In [44]:
salary_table_2020.sort(1, descending=True).show(5)

______

### Advanced grouping

#### `welcome_survey` dataset

In [ ]:
survey = Table.read_table('welcome_survey_sp24.csv')
underclassmen = make_array('First Year','Second Year', 'Third Year','Fourth Year')
survey = survey.where('Year', are.contained_in(underclassmen))
survey.show(5)

**Discussion Question 2**: How many rows and how many columns will the table be that is produced by the following code?

In [ ]:
survey.group('Year')

**Discussion Question 3**: How many rows and how many columns will the table be that is produced by the following code?

In [ ]:
survey.group('Year', np.average)

In [ ]:
survey.drop('Handedness', 'Sleep position', 'Pets', 'TV').group('Year', np.average)

#### **Challenge Task (`nba` dataset)** Find the $n$ teams paying the highest average salary (in millions) in season $y$.
- In other words, write code that will produce the table you made above, but for any given $n$ and $y$.

Note that in this solution, we are calling the function `average_in_millions` inside of our `highest_paying_teams` function!!!

In [47]:
def highest_paying_teams(y, n):
    """gives a table of NBA teams with the highest average salary"""
    salary_table = nba.where('season', y).select('team', 
                                 'salary').group('team', average_in_millions)
    return salary_table.sort(1, descending=True).show(n)

In [48]:
highest_paying_teams(2016,3)